[
  {
    "title": "What is RAW View?",
    "content": "RAW View is an Android TV application specifically designed to view RAW image files from USB drives on your TV. It supports 11 different RAW formats from major camera manufacturers and also handles standard photos, videos, and audio files, making it a comprehensive media viewer for Android TV."
  },
  {
    "title": "Which RAW image formats does RAW View support?",
    "content": "RAW View supports 11 RAW image formats: NEF (Nikon), CR2 and CR3 (Canon), ARW (Sony), DNG (Adobe/Universal), RAF (Fujifilm), ORF (Olympus), RW2 (Panasonic), PEF (Pentax), SRW (Samsung), and NRW (Nikon). These cover most professional and prosumer camera systems."
  },
  {
    "title": "Does RAW View require a subscription?",
    "content": "RAW View operates on a subscription-based model. The app includes a dedicated subscription page where you can subscribe, and a manage subscription page that provides information on how to view, modify, or cancel your subscription through the Google Play Store."
  },
  {
    "title": "How do I load my photos and videos into RAW View?",
    "content": "Simply connect your USB drive containing media files to your Android TV device. RAW View automatically scans the USB drive for folders, RAW/normal photos, videos, and music files, then lists them with thumbnails and file names. You can also use the reload files menu to rescan the drive at any time."
  },
  {
    "title": "Can I view metadata information from my RAW images?",
    "content": "Yes, RAW View includes a metadata viewer. When viewing an image, press the OK button on your remote to access image options, then select 'toggle metadata info' to show or hide the metadata. You can use the D-pad up/down keys to scroll through the metadata information."
  },
  {
    "title": "How do I zoom and rotate images in RAW View?",
    "content": "While viewing an image, press the OK button on your remote to open the image options menu. From there, you can select zoom in, zoom out, fit mode (fit to height/width), or rotate (which rotates the image 90 degrees with each selection)."
  },
  {
    "title": "Does RAW View have a slideshow feature?",
    "content": "Yes, RAW View includes a full-featured slideshow mode. Press OK while viewing an image and select the slideshow option to play all images in the current folder. You can pause/play by pressing OK, increase slide duration with the down button, decrease it with the up button, and the app will skip any failed images in subsequent loops."
  },
  {
    "title": "What video formats can RAW View play?",
    "content": "RAW View supports 14 video formats: MP4, AVI, MKV, MOV, FLV, WMV, WebM, M4V, 3GP, TS, MTS, M2TS, VOB, and OGV. This covers most common video file types you'll encounter from cameras, drones, and other recording devices."
  },
  {
    "title": "Does RAW View support subtitles for videos?",
    "content": "Yes, RAW View supports 7 subtitle formats: SRT, VTT, ASS, SSA, TTML, DFXP, and XML. You can select closed caption subtitles using the player controls while watching a video."
  },
  {
    "title": "Will RAW View remember where I stopped watching a video?",
    "content": "Yes, RAW View saves your playback progress. When you close a video, the progress is saved and updated in the home listing. If you reopen a previously watched video, you'll be prompted with a dialog to either start over or resume playback from where you left off."
  },
  {
    "title": "Can RAW View play audio files?",
    "content": "Yes, RAW View supports 13 audio formats: MP3, M4A, AAC, OGG, OGA, Opus, FLAC, WAV, WebM, MKV, MKA, TS, 3GP, and AMR. The audio player features clean controls with rewind/forward (5 seconds), progress bar, and current time/total duration display. Note that audio playback always starts from the beginning."
  },
  {
    "title": "How do I navigate during video or audio playback?",
    "content": "RAW View provides clean player controls for both video and audio. You can rewind or fast forward by 5 seconds using the remote controls, view the progress bar with current time and total duration, and access subtitle options for videos. The interface is designed specifically for Android TV remote navigation."
  },
  {
    "title": "What information can I see in the app settings?",
    "content": "The app settings page displays your device's screen resolution, screen ratio, available storage space, total number of thumbnail files, and total size of thumbnails. You also have the option to clear all thumbnails and video progress data from this page."
  },
  {
    "title": "How do I control slideshow speed in RAW View?",
    "content": "During a slideshow, you can adjust the slide interval by pressing the up button to decrease duration (faster transitions) or the down button to increase duration (slower transitions). The slideshow also displays a photo/slide index indicator in the top right corner so you can track your position."
  },
  {
    "title": "Why do I need to clear thumbnails?",
    "content": "Thumbnails are cached images that help RAW View load and display your media library quickly. Over time, these can consume storage space on your Android TV device. The app settings page allows you to check how much storage thumbnails are using and clear them if needed to free up space."
  },
  {
    "title": "What if I need to rescan my USB drive?",
    "content": "RAW View includes a 'reload files' menu option that allows you to rescan the USB drive at any time. This is useful if you've added or removed files from the USB drive, or if you've connected a different USB drive to your Android TV."
  },
  {
    "title": "How can I get help or contact support?",
    "content": "RAW View includes multiple support resources: a comprehensive help/FAQ page within the app that covers common queries with detailed answers, a support and feedback page with QR codes linking to the Facebook support page and feedback form, and an about us page with developer details."
  },
  {
    "title": "Where can I find the app version number?",
    "content": "RAW View includes a dedicated version info menu item, making it easy to check which version of the app you're running. This is particularly useful when troubleshooting issues or checking if you have the latest update."
  },
  {
    "title": "Are there privacy policy and terms of use available?",
    "content": "Yes, RAW View includes dedicated pages for both the privacy policy and terms of use. These are accessible from within the app and outline how your data is handled and the conditions for using the application."
  },
  {
    "title": "Is RAW View designed specifically for Android TV?",
    "content": "Yes, RAW View's user interface is developed based on Android TV development principles, ensuring optimal navigation with TV remotes and a user experience tailored for large screens. The interface uses D-pad navigation and is optimized for viewing from a distance."
  }
]
