[
  {
    "title": "How do I reset my password if I forget it?",
    "content": "If you forget your password, you will need to reinstall the app. Please note that reinstalling the app will result in the loss of all saved notes."
  },
  {
    "title": "How does PaperBit encrypt my notes?",
    "content": "PaperBit uses AES-256 encryption to securely store your notes on your device. This ensures that your notes are only accessible by you."
  },
  {
    "title": "Can I backup my notes?",
    "content": "Currently, PaperBit does not support automatic backups. However, you can manually export your notes to a secure location."
  },
  {
    "title": "Is there a limit to the number of notes I can create?",
    "content": "There is no limit to the number of notes you can create in PaperBit. The only limitation is the available storage space on your device."
  },
  {
    "title": "How can I export my notes?",
    "content": "You can export your notes by going to the settings menu and selecting the export option. This will allow you to save your notes to a secure location of your choice."
  },
  {
    "title": "How do I delete a note?",
    "content": "To delete a note, long-press on the note you want to delete and select the delete option from the menu."
  },
  {
    "title": "Can I categorize my notes?",
    "content": "Yes, PaperBit allows you to categorize your notes. You can create custom categories and assign notes to them for better organization."
  },
  {
    "title": "Is there a dark mode available?",
    "content": "Yes, PaperBit includes a dark mode option that you can enable from the settings menu."
  },
  {
    "title": "How secure is PaperBit?",
    "content": "PaperBit is highly secure. It uses AES-256 encryption to store notes, and access is protected by a numeric password. Ensure your password is strong and not shared with others."
  },
  {
    "title": "What happens if I lose my phone?",
    "content": "If you lose your phone, your notes remain encrypted and secure. However, if you don't have a backup, the notes will be irretrievable without your password."
  },
  {
    "title": "How do I change my password?",
    "content": "To change your password, go to the settings menu and select the change password option. You will need to enter your current password to set a new one."
  },
  {
    "title": "Can I sync my notes across multiple devices?",
    "content": "Currently, PaperBit does not support syncing notes across multiple devices. All notes are stored locally on your device."
  },
  {
    "title": "What should I do if the app crashes?",
    "content": "If the app crashes, try restarting your device and opening the app again. If the issue persists, please contact our support team for assistance."
  },
  {
    "title": "How can I contact support?",
    "content": "You can contact our support team by emailing support@paperbit.com. We aim to respond to all queries within 24 hours."
  }
]
