[
  {
    "title": "What is a multi-profile browser?",
    "content": "A multi-profile browser is an application that allows you to create and manage multiple browsing profiles for different websites. Each profile has its own memory space, enabling you to maintain separate sessions, settings, and data for various online accounts or purposes."
  },
  {
    "title": "How do I add a new website to the browser?",
    "content": "To add a new website, navigate to the main menu of the app. You'll find an option to add a website where you can enter the URL, title, and select or upload a logo for the site."
  },
  {
    "title": "Can I create multiple profiles for a single website?",
    "content": "Yes, you can create any number of profiles for each website. This is useful for managing multiple accounts on the same platform or separating personal and professional use of a site."
  },
  {
    "title": "How do I switch between different profiles?",
    "content": "Each profile opens in a separate window, allowing you to easily switch between them using your device's recent apps bar. This makes multitasking with different profiles quick and convenient."
  },
  {
    "title": "Can I customize the appearance of websites in the app?",
    "content": "Yes, the app displays each website with its logo, title, and URL for easy identification. You can edit these details for each website from the main menu."
  },
  {
    "title": "What should I do if a website isn't loading correctly?",
    "content": "If you encounter issues with a website loading, you can report it directly to the developer using the 'Report Website' option available for each site in the main menu."
  },
  {
    "title": "How do I navigate back to the main page of a website within a profile?",
    "content": "In the profile view, there's a home button that takes you back to the base URL of the website specified for that profile in the main menu."
  },
  {
    "title": "Can I change the name of a profile after creating it?",
    "content": "Yes, in the profile view, you'll find an option to edit the profile name. This allows you to update or change profile names as needed."
  },
  {
    "title": "Is it possible to open a different URL within an existing profile?",
    "content": "Absolutely. In the profile view, there's an option to open a new URL. This allows you to navigate to different pages or sites while maintaining the profile's separate memory space."
  },
  {
    "title": "How can I share the current webpage I'm viewing?",
    "content": "The profile view includes a share option that allows you to share the current URL with others through various apps on your device."
  },
  {
    "title": "Can I create a shortcut for a specific profile on my home screen?",
    "content": "Yes, the app provides an option to add a profile to your device's home screen. This creates a shortcut that opens directly to that specific profile view."
  },
  {
    "title": "How do I delete a profile I no longer need?",
    "content": "In the profile view, you'll find an option to delete the profile. This removes the profile and its associated data from the app."
  },
  {
    "title": "Does the app have a dark mode?",
    "content": "Yes, the app supports both light and dark themes. You can toggle between these themes in the main activity of the app."
  },
  {
    "title": "Is this a subscription-based app?",
    "content": "The app offers subscription options. You can manage your subscription from the main menu of the app."
  },
  {
    "title": "Where can I find the privacy policy and terms of conditions?",
    "content": "Links to the privacy policy and terms and conditions are available in the main menu of the app."
  },
  {
    "title": "How can I provide feedback or request new features?",
    "content": "The app includes a feedback and support link in the main menu. You can use this to request new features, report issues, or provide general feedback about the app."
  },
  {
    "title": "Is my data in different profiles kept separate?",
    "content": "Yes, each profile has its own memory space, ensuring that data, cookies, and browsing history from one profile do not interfere with others."
  },
  {
    "title": "Can I use multiple profiles simultaneously?",
    "content": "Yes, you can open multiple profiles at the same time. Each profile opens in a separate window, allowing for easy multitasking."
  },
  {
    "title": "How do I update or remove a website from the app?",
    "content": "In the main menu, you can select a website to edit its details or delete it from the app entirely."
  },
  {
    "title": "Is it possible to import or export my profiles and website settings?",
    "content": "Currently, the app doesn't have a built-in import/export feature. However, this could be a great feature to request through the feedback option in the app."
  }
]