[
  {
    "title": "What is Photo Dream Screensaver?",
    "content": "Photo Dream Screensaver allows you to display your personal photos as a beautiful slideshow screensaver on your Android TV. Your selected photos are shown automatically when the screensaver starts, turning your TV into a personal photo frame."
  },
  {
    "title": "Which devices are supported?",
    "content": "Photo Dream Screensaver is designed exclusively for TV devices. It supports Android TV, Google TV, and Fire TV. This app is not available for mobile phones or tablets."
  },
  {
    "title": "Do I need a keyboard or mouse to use this app?",
    "content": "No. The app is fully optimized for Android TV and can be completely controlled using your TV remote. A mouse can be used if connected, but it is not required."
  },
  {
    "title": "How can I add photos to the screensaver?",
    "content": "You can upload photos to your TV using multiple methods: Web upload, through Wi-Fi, or FTP connection. All upload options are available directly from the app menu."
  },
  {
    "title": "Where are my photos stored?",
    "content": "All your photos are stored locally on your TV device only. Photo Dream Screensaver does not upload or store your photos on any external servers or cloud services."
  },
  {
    "title": "Is my data safe and private?",
    "content": "Yes. Your personal photos never leave your TV. The app does not require login, does not collect personal data, and does not access external storage or USB devices."
  },
  {
    "title": "What happens to photos uploaded via the web?",
    "content": "Photos uploaded through the web interface are automatically deleted from the server once they are downloaded to your TV. If a download fails or a token expires, the uploaded files are automatically deleted within one hour."
  },
  {
    "title": "How many photos can I use in the free version?",
    "content": "The free version allows you to use up to 5 photos as a screensaver. To add more photos, you need to subscribe to a premium plan."
  },
  {
    "title": "What subscription plans are available?",
    "content": "Photo Dream Screensaver offers multiple subscription options including monthly, quarterly, half-yearly, and yearly plans. Subscribing removes the photo limit and unlocks full functionality."
  },
  {
    "title": "What happens when my subscription expires?",
    "content": "When your subscription expires, the app continues to work in free mode. Only up to 5 photos will be used for the screensaver, but your existing photos remain safely stored on your device."
  },
  {
    "title": "How do I activate the screensaver?",
    "content": "The app provides an Activate option that takes you directly to your TV’s screensaver settings, making it easy to select and enable Photo Dream Screensaver."
  },
  {
    "title": "Does the app work without an internet connection?",
    "content": "Yes. Once your photos are added to the TV, the screensaver works completely offline. An internet connection is only needed for uploading photos or displaying limited informational content."
  },
  {
    "title": "Does this app collect any user data?",
    "content": "The app does not collect personal or identifiable user data. Only anonymous performance analytics and crash reports are collected to improve app stability and user experience."
  },
  {
    "title": "Can this app be used for business or signage purposes?",
    "content": "While Photo Dream Screensaver is designed mainly for personal use, it can also be used for simple business displays or signage where photo slideshows are required."
  },
  {
    "title": "What should I do if the screensaver is not starting?",
    "content": "Make sure Photo Dream Screensaver is selected as the active screensaver in your TV settings and that at least one photo is added. Some TVs may require disabling battery or power optimizations."
  },
  {
    "title": "How can I contact support?",
    "content": "If you need help or have questions, you can contact support at deepakpk009@yahoo.in or visit https://deepakpk.com/Photo Dream."
  }
]
