[
  {
    "title": "How do I install the USB slideshow app?",
    "content": "Insert the USB into your computer, open the USB drive, and double-click the installation file. Follow the on-screen instructions to complete the installation."
  },
  {
    "title": "What file formats does the app support?",
    "content": "The app supports JPEG, PNG, MP4, and AVI file formats for photos and videos."
  },
  {
    "title": "Can I add music to my slideshow?",
    "content": "Yes, you can add MP3 files to your USB drive and select the background music from the app menu. The app also offers an option to override the video sound with the selected music."
  },
  {
    "title": "How do I create a new slideshow?",
    "content": "Open the app, click on 'Create New Slideshow,' and follow the prompts to add your photos, videos, and music. You can adjust the photo display time and choose to randomize the order of photo videos or name the files in order for sequential playback."
  },
  {
    "title": "Is there a limit to the number of photos or videos I can add?",
    "content": "There is no limit to the number of photos or videos you can add, but in demo mode, only 10 slides will be shown. To unlock full access, you need to purchase the pro mode."
  },
  {
    "title": "Can I adjust the display time for each photo?",
    "content": "Yes, you can adjust the display time for each photo in the slideshow settings."
  },
  {
    "title": "How can I randomize the order of photo videos in my slideshow?",
    "content": "You can choose the option to randomize the order of photo videos during the slideshow creation process."
  },
  {
    "title": "If I want the slideshow in order, do I need to name the files in a specific way?",
    "content": "Yes, if you want the slideshow to play in a specific order, you need to name the files accordingly to ensure sequential playback."
  },
  {
    "title": "What features are available in the demo mode of the app?",
    "content": "In demo mode, only 10 slides will be shown, and some advanced features may be restricted. To unlock full access, you need to purchase the pro mode."
  },
  {
    "title": "How can I unlock the full version of the app?",
    "content": "To unlock the full version of the app, you need to purchase the pro mode."
  },
  {
    "title": "Can I override the sound of videos with background music?",
    "content": "Yes, you can override the sound of videos with background music by selecting the appropriate option in the app settings."
  },
  {
    "title": "How do I add background music to my slideshow?",
    "content": "You can add background music by adding MP3 files to your USB drive and selecting the desired music from the app menu."
  },
  {
    "title": "What types of transition effects can I customize?",
    "content": "You can customize various transition effects such as fade, slide, and dissolve from the 'Settings' menu within the app."
  },
  {
    "title": "Where can I find the settings menu to customize transition effects?",
    "content": "You can find the settings menu within the app interface where you can customize transition effects and other settings."
  },
  {
    "title": "Does the app offer technical support?",
    "content": "Yes, the app offers technical support to assist you with any issues or questions you may have."
  },
  {
    "title": "Can I transfer the app license to another device?",
    "content": "The possibility of transferring the app license to another device depends on the licensing terms. Please refer to the license agreement or contact support for assistance."
  },
  {
    "title": "Will my slideshow settings be saved if I exit the app?",
    "content": "Yes, your slideshow settings will be saved automatically when you exit the app, ensuring that you can resume from where you left off."
  },
  {
    "title": "Is there an option to loop the slideshow continuously?",
    "content": "Yes, you can enable the option to loop the slideshow continuously from the app settings."
  },
  {
    "title": "Can I pause or stop the slideshow midway?",
    "content": "Yes, you can pause or stop the slideshow at any time by using the controls provided within the app interface."
  },
  {
    "title": "Are there any tutorials or guides available for using the app?",
    "content": "Yes, there may be tutorials or guides available within the app or on the developer's website to help you with using the app effectively."
  }
]
