[
  {
    "title": "What photo file formats does the app support?",
    "content": "The app supports JPEG, PNG, GIF, BMP, and WEBP file formats for photos."
  },
  {
    "title": "What video file formats does the app support?",
    "content": "The app supports MP4, 3GP, AVI, and MPEG file formats for videos."
  },
  {
    "title": "What audio file formats does the app support?",
    "content": "The app supports WAV, OGG, MP4, and AAC file formats for audio."
  },
  {
    "title": "Can I add music to my slideshow?",
    "content": "Yes, you can add audio files to your USB drive and select the background music from the app menu. The app also offers an option to override the video sound with the selected music."
  },
  {
    "title": "Is there a limit to the number of photos or videos I can add?",
    "content": "There is no limit to the number of photos or videos you can add, but in demo mode, only 10 slides will be shown. To unlock full access, you need to purchase the pro mode."
  },
  {
    "title": "Can I adjust the display time for each photo?",
    "content": "Yes, you can adjust the display time for each photo in the slideshow settings."
  },
  {
    "title": "How can I randomize the order of photo videos in my slideshow?",
    "content": "You can choose the option to shuffle the slides from the main menu."
  },
  {
    "title": "If I want the slideshow in order, do I need to name the files in a specific way?",
    "content": "Yes, if you want the slideshow to play in a specific order, you need to name the files in alphabetical order to ensure sequential playback."
  },
  {
    "title": "What features are available in the demo mode of the app?",
    "content": "In demo mode, only 10 slides will be shown, and some advanced features may be restricted. To unlock full access, you need to purchase the pro mode."
  },
  {
    "title": "How can I unlock the full version of the app?",
    "content": "To unlock the full version of the app, you need to purchase the pro mode."
  },
  {
    "title": "Can I override the sound of videos with background music?",
    "content": "Yes, you can override the sound of videos with background music by selecting the appropriate option in the app settings."
  },
  {
    "title": "What types of transition effects can I customize?",
    "content": "You can customize various transition effects such as fade, slide, and dissolve from the 'Settings' menu within the app."
  },
  {
    "title": "Does the app offer technical support?",
    "content": "Yes, the app offers technical support to assist you with any issues or questions you may have via its Facebook page. Scan the QR code in the support page to visit the Facebook page."
  },
  {
    "title": "Will my slideshow settings be saved if I exit the app?",
    "content": "Yes, your slideshow settings will be saved automatically when you exit the app, ensuring that you can resume from where you left off."
  },
  {
    "title": "Will the slideshow loop continuously?",
    "content": "Yes, the slideshow is looped by default."
  },
  {
    "title": "Can I pause or stop the slideshow midway?",
    "content": "Yes, you can stop the slideshow at any time by using the back button on the remote."
  }
]
